# Задача №4
num = int(input("Введите число: "))

print(bin(num))